[
    "Mechanics: Onagers in DE can be shift-queued to cut trees, so cutting through forests require significantly less attention.",
    "Mechanics: If a Villager is about to die to a wolf or boar, you can place a building foundation on it and spam right click on the building to interupt the animal's aggression, allowing you to save your Villager.",
    "Mechanics: You can drop off any resource into your stockpile when a Villager completes a Lumber Camp, Mining Camp, Mill, Farm, or Town Center.",
    "Mechanics: If you garrison 6 Villagers into your Town Center, you can shoot a boar 2 times with the Town Center before ungarrisonning and finishing it off with villagers. If you kill the boar with the Town Center, the food will disappear.",
    "Technologies: Since Supplies costs 150F/100G, you've only saved the food cost after creating 10 Militia, and the total resource cost after creating 17.",
    "Technologies: The Paladin upgrade costs 1300F/750G and increases Hit Points by 40, Attack by 2, and Pierce Armor by 1. It also slightly reduces attack speed, however.",
    "Technologies: Wheelbarrow takes just as long to research as creating 3 villagers (75 seconds).",
    "Technologies: The Indian's Sultans technology affects all gold sources, including trade and relics.",
    "Units: A fully upgraded Arbalester does two damage to Packed Trebuchets since they have 10 attack vs the Trebuchet's 8 Pierce Armor.",
    "Units: A fully upgraded Bombard Tower does 124 damage, so in order to take 2 shots to kill, a Knight (or Cavalier without Bloodlines) must have the final Armor upgrade.",
    "Units: Rams have -3 Melee Armor, so they take an extra 3 damage from melee attacks.",
    "Unique Units: The Mameluke, Conquistador, Arambai, War Wagon, Slinger, and Janissary have the Archer Armor Class, which means they take extra damage from anti-archer units such as Skirmishers.",
    "Unique Units: Longbowmen have 12 range when fully upgraded.",
    "Unique Units: Elite Huskarls have 10 Pierce Armor when fully upgraded, which means that they take 1 damage from most archers. Plumed Archers get +2 vs Infantry, so they end up always doing 2 damage.",
    "Miscellaneous: Villagers gather shore fish and deep fish at the same rate.",
    "Miscellaneous: Elephants and Rhinoceroses provide 400 food (Wild Boar has 340), but end up doing more damage to villagers when luring due to their lower attack animation time."
]